#+title: data steward survey 2021 --- processing & scratchpad
# this sets the properties for all R source code blocks, so they are all related to the session
#+property: header-args:R  :session *R:survey* :exports results :results output :eval no-export

** did we put all the necessary columns in the file?
#+begin_src R :results value
  colnames(dat)[!colnames(dat) %in% Qs$column]
#+end_src

#+RESULTS:
| StartDate             |
| EndDate               |
| Status                |
| IPAddress             |
| Progress              |
| Duration (in seconds) |
| Finished              |
| RecordedDate          |
| ResponseId            |
| RecipientLastName     |
| RecipientFirstName    |
| RecipientEmail        |
| ExternalReference     |
| LocationLatitude      |
| LocationLongitude     |
| DistributionChannel   |
| UserLanguage          |

looks like I did, these are only tracking metadata which are mostly empty because we used anonymous urls to get the survey responses.
** save the plot for each column
#+begin_src R
  Qss <- Qs |> select(category, column, pl) |>
    mutate(rownum = row_number()) |>
    mutate(filename = paste0("imgs/", str_pad(rownum, side = "left", pad = "0", width = 3), "_", category, "_", column, ".png"))

  walk2(Qss$filename, Qss$pl, ~ ggsave(.x, plot = .y, width = 1920, height = 1080, units = "px", dpi = 200))
#+end_src

#+RESULTS:
: There were 13 warnings (use warnings() to see them)

